rotten_mangoes/app/models/movie.rb

  def review_average
    if self.reviews.size > 0
      self.reviews.sum(:rating_out_of_ten)/reviews.size
---
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?
SELECT SUM("reviews"."rating_out_of_ten") AS sum_id FROM "reviews"  WHERE "reviews"."movie_id" = ?